#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.cloudwatch_logs.aws_cloudwatch_log_group.logs: Refreshing state... [id=/machamp/staging/ecs]
module.rds.aws_db_parameter_group.this: Refreshing state... [id=machamp-staging]
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-09d8ac12538411d38]
module.ecs.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:cluster/machamp-staging-cluster]
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=machamp-repository]
module.rds.aws_db_option_group.this: Refreshing state... [id=machamp-staging]
module.ecs.module.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-task-execution]
module.ecs.aws_ecs_task_definition.taskdef: Refreshing state... [id=staging]
module.ecr.aws_ecr_lifecycle_policy.ecr_lifecycle: Refreshing state... [id=machamp-repository]
module.ecs.module.ecs_task_execution_role.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::762742784206:policy/ecs-task-execution]
module.ecs.module.ecs_task_execution_role.aws_iam_role_policy_attachment.default: Refreshing state... [id=ecs-task-execution-20210627042409046500000001]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-046885f5dcadc1a74]
module.network.aws_route_table.public: Refreshing state... [id=rtb-08d95bad8bfeca94f]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-0f47b5557a518ee32]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-04c459391a247e0ab]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-0a83fa62921aeea12]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-0962108c7fb9f8005]
module.alb_sg.aws_security_group.this: Refreshing state... [id=sg-0b94fad4952f71e82]
module.ecs_task_sg.aws_security_group.this: Refreshing state... [id=sg-0ecf024155c1e1ead]
module.db_sg.aws_security_group.this: Refreshing state... [id=sg-0e7f2b8890b526257]
module.network.aws_route.public: Refreshing state... [id=r-rtb-08d95bad8bfeca94f1080289494]
module.ecs_task_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-2229708895]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=machamp-staging-subnet-group]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0c69729f22986dd8b]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-0b1a88da4ee7a84c3]
module.db_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1946603049]
module.db_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-397310042]
module.alb_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-264386788]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3114642683]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[2]: Refreshing state... [id=sgrule-2383088866]
module.alb_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-905255602]
module.alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:loadbalancer/app/machamp-staging-alb/be65d89006037d98]
module.ecs_task_sg.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-486575180]
module.rds.aws_db_instance.this: Refreshing state... [id=machamp-staging-db]
module.alb.aws_lb_target_group.this[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/staging-target-group-for-test/07569c0bb2f072c2]
module.alb.aws_lb_target_group.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:targetgroup/staging-target-group-for-users/a012264ca0e3b057]
module.alb.aws_lb_listener.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/be65d89006037d98/fee1b3c39496803a]
module.alb.aws_lb_listener.this[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:762742784206:listener/app/machamp-staging-alb/be65d89006037d98/9d704eeea30ab85f]
module.ecs.aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:762742784206:service/machamp-staging-cluster/machamp-staging-service]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.elasticache.aws_elasticache_replication_group.this will be created
  + resource "aws_elasticache_replication_group" "this" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "5.0.6"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t3.micro"
      + number_cache_clusters          = 1
      + parameter_group_name           = (known after apply)
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replication_group_description  = "Cluster Disabled"
      + replication_group_id           = "machamp-staging-redis"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "machamp-staging-redis-subnet-group"
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

  # module.elasticache.aws_elasticache_subnet_group.this will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "machamp-staging-redis-subnet-group"
      + subnet_ids  = [
          + "subnet-04c459391a247e0ab",
          + "subnet-0f47b5557a518ee32",
        ]
      + tags_all    = (known after apply)
    }

  # module.redis_sg.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-redis-sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-redis-sg"
        }
      + vpc_id                 = "vpc-09d8ac12538411d38"
    }

  # module.redis_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.redis_sg.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0ecf024155c1e1ead"
      + to_port                  = 6379
      + type                     = "ingress"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>